ZZY5825/Lock-in-Amplifier-STM32CubeIDE/Core/Inc/main.h
/* USER CODE BEGIN Header */
/**
  ******************************************************************************
  * @file           : main.h
  * @brief          : Header for main.c file.
  *                   This file contains the common defines of the application.
  ******************************************************************************
  * @attention
  *
  * Copyright (c) 2025 STMicroelectronics.
  * All rights reserved.
  *
  * This software is licensed under terms that can be found in the LICENSE file
  * in the root directory of this software component.
  * If no LICENSE file comes with this software, it is provided AS-IS.
  *
  ******************************************************************************
  */
/* USER CODE END Header */

/* Define to prevent recursive inclusion -------------------------------------*/
#ifndef __MAIN_H
#define __MAIN_H

#ifdef __cplusplus
extern "C" {
#endif

/* Includes ------------------------------------------------------------------*/
#include "stm32f4xx_hal.h"

/* Exported functions prototypes ---------------------------------------------*/
void SystemClock_Config(void);
void Error_Handler(void);

#ifdef USE_FULL_ASSERT
void assert_failed(uint8_t *file, uint32_t line);
#endif

/* Private defines -----------------------------------------------------------*/
#define USART_TX_Pin        GPIO_PIN_2
#define USART_TX_GPIO_Port  GPIOA
#define USART_RX_Pin        GPIO_PIN_3
#define USART_RX_GPIO_Port  GPIOA
#define LD2_Pin             GPIO_PIN_5
#define LD2_GPIO_Port       GPIOA

#define GAIN_Pin            GPIO_PIN_12
#define GAIN_GPIO_Port      GPIOB
#define GAIN_EXTI_IRQn      EXTI15_10_IRQn

#define BW_PLUS_Pin         GPIO_PIN_14
#define BW_PLUS_GPIO_Port   GPIOB
#define BW_PLUS_EXTI_IRQn   EXTI15_10_IRQn

#define BW_MINUS_Pin        GPIO_PIN_15
#define BW_MINUS_GPIO_Port  GPIOB
#define BW_MINUS_EXTI_IRQn  EXTI15_10_IRQn

#define TMS_Pin             GPIO_PIN_13
#define TMS_GPIO_Port       GPIOA
#define TCK_Pin             GPIO_PIN_14
#define TCK_GPIO_Port       GPIOA
#define SWO_Pin             GPIO_PIN_3
#define SWO_GPIO_Port       GPIOB

#ifdef __cplusplus
}
#endif

#endif /* __MAIN_H */
